Revit 2026 API

# ElementRecordWorksetId Property

---

Get Id of the workset which owns the element.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public WorksetId WorksetId { get; }
```
```vb
Public ReadOnly Property WorksetId As WorksetId
	Get
```
```cpp
public:
property WorksetId^ WorksetId {
	WorksetId^ get ();
}
```
```fsharp
member WorksetId : WorksetId with get
```

#### Property Value

WorksetId

Each element belongs to one and only one workset.

#### Reference

ElementRecord Class

Autodesk.Revit.DB Namespace